PDK-63/STM32/RemoteLora/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MCU_PWR_READ1_Pin GPIO_PIN_0
#define MCU_PWR_READ1_GPIO_Port GPIOF
#define MCU_PWR_READ2_Pin GPIO_PIN_1
#define MCU_PWR_READ2_GPIO_Port GPIOF
#define MCU_PWR_READ3_Pin GPIO_PIN_0
#define MCU_PWR_READ3_GPIO_Port GPIOA
#define MCU_PWR_READ4_Pin GPIO_PIN_1
#define MCU_PWR_READ4_GPIO_Port GPIOA
#define MCU_PWR_EN_Pin GPIO_PIN_2
#define MCU_PWR_EN_GPIO_Port GPIOA
#define LORA_RESET_Pin GPIO_PIN_3
#define LORA_RESET_GPIO_Port GPIOA
#define LORA_NSS_Pin GPIO_PIN_4
#define LORA_NSS_GPIO_Port GPIOA
#define LORA_IRQ_Pin GPIO_PIN_1
#define LORA_IRQ_GPIO_Port GPIOB
#define LORA_DI1_Pin GPIO_PIN_9
#define LORA_DI1_GPIO_Port GPIOA
#define LED_STATUS_Pin GPIO_PIN_10
#define LED_STATUS_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
